app/views/clients/show.html.erb

	<span> Name: <%= t "Name", age: @client.first_name %>
	Avatar: <%= image_tag @client.avatar.url(:thumb) %> </span> has <%= @client.orders_count %> order: </p>
---
SELECT "orders".* FROM "orders"  WHERE "orders"."client_id" = ?  [["client_id", 9]]