app/controllers/clients_controller.rb

	def show
		@client = Client.find(params[:id])
		@orders = @client.orders.all
---
SELECT  "clients".* FROM "clients"  WHERE "clients"."id" = ? LIMIT 1  [["id", 7]]
SELECT "orders".* FROM "orders"  WHERE "orders"."client_id" = ?  [["client_id", 9]]

	def destroy
		if Client.delete(params[:id])
---
DELETE FROM "clients" WHERE "clients"."id" = 7

	def update
  		@client = Client.find(params[:id])
  		if @client.update(client_params)
---
SELECT  "clients".* FROM "clients"  WHERE "clients"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "clients" SET "orders_count" = ?, "updated_at" = ? WHERE "clients"."id" = 14  [["orders_count", 12], ["updated_at", "2016-03-25 10:19:17.591109"]]

  	def create
	    @client = Client.new(client_params)
	    if @client.save
---
INSERT INTO "clients" ("created_at", "first_name", "orders_count", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-03-25 09:52:39.036774"], ["first_name", "haha"], ["orders_count", 5], ["updated_at", "2016-03-25 09:52:39.036774"]]